[
    {
        "lang" : "English",
        "content" : [
            "Enter username and password to login and use the app!", 
            "Login",
            "Name should have at least 5 characters length.",
            "Name",
            "Username should have at least 8 characters length.",
            "Username",
            "Password should have at least 8 characters length, include numbers, both uppercase and lowercase letters and at least one special character (! @ # ? ]).",
            "Password",
            "Enter name, username and password to create an account.",
            "Passwords do not match.",
            "Repeat password",
            "You have successfully created a new account! Log in and get in :)",
            "Register",
            "Create a password to use the BRINGM3 app.",
            "Change pallet",
            "Theme and pallet",
            "You can customize the color palette of the application to your liking. This will make it more comfortable to use.",
            "About",
            "This application was created as a project for a thesis.\n \nThe application is designed to compile and administer a family or personal shopping list.\n \nThe project is written on the Next.js platform (Node, React, Ramda). The source code can be found on ",
            "\nThe project was created by Denis Kuivalainen with the help of Maria Solovieva (pallets), Aleksandr Shchilkin (logo), Alina Grigoryan (translation to Russian) and Justus Juutilainen (translation to Finnish).  \n \n If you have any issues, contact me: ",
            "Logout",
            "If you have finished using the application on this device, we recommend you to log out.",
            "Logout",
            "Username or password is not correct.",
            "This username already exists. Create another one.",
            "Item list",
            "Item list is loading...",
            "Here is the list of items that are required to be bought. Go and bring them! Or add a new need to the list for someone to buy...",
            "You reserved this to bring.",
            "Cancel reservation",
            "I'll bring it!",
            "Add",
            "added this.",
            "Add a new item",
            "Here you can add a new item to the shopping list.",
            "Item",
            "Description",
            "You logged in as ",
            "Back",
            "User can ",
            "add",
            "reserve and delete",
            "List of members",
            "Here you can edit the list of members of your family.",
            "Manage users",
            "Here you, as the head of this family, can manage the other members.",
            "Add user",
            "To add a new user to your family, create login and name. You can assign rights to add, reserve and delite items from the grocery list, if you wish. To save the new user press button 'ADD'.",
            "Edit user",
            "Edit user ",
            "information by filling the following form.",
            "Edit",
            "Start managing your family groceries with the BRINGM3 app! It is fun, easy and entertaining! Join today and become happy!",
            "If you are new to this app, just go to ",
            "the register page",
            " and become the head of the family.",
            "Or, if you are already a senior user, ",
            "log in",
            "OR! If you were registered by the head of the family, ",
            "set the password",
            " for your newly created account.",
            "To use action buttons of the list hold press for a second.",
            "How to use?",
            "1. Press the 'ADD' button to add a new item to the list. \n \n2. In addition to the item name you can add a description.\n \n3. Press the 'ADD' button again to save the new item. \n \n4. After the item was added to the list you can press it to reveal its description, information who added it  and unlock action buttons. \n \n5. To reserve an item from the list, select the needed item and press the 'I`LL BRING IT!' button for a second.\n \n6. To cancel the reservation of an item from the list, select the needed item and press the  'CANCEL RESERVATION' button for a second.\n \n7. To delete an item from the list, select the needed item and press the  check mark on the left of its name for a second.",
            "Link for registration was copied"
        ]
    },
    {
        "lang" : "Suomi",
        "content" : [
            "Syötä käyttäjätunnus ja salasana kirjautuaksesi sovellukseen!", 
            "Kirjaudu",
            "Nimen pitää olla vähintään 5 merkin mittainen.",
            "Nimi",
            "Käyttäjätunnuksen pitää olla vähintään 8 merkin mittainen.",
            "Käyttäjätunnus",
            "Salasanan pitää olla vähintään 8 merkkiä pitkä, sisältää numeroita, isoja- ja pieniä kirjaimia, sekä vähintään yksi erikoismerkki (! @ # ? ]).",
            "Salasana",
            "Syötä nimi, käyttäjätunnus ja salasana luodaksesi käyttäjä.",
            "Salasana ei täsmää.",
            "Toista salasana",
            "Olet onnistuneesti luonut uuden käyttäjän! Kirjaudu sisään aloittaaksesi :) ",
            "Rekisteröidy",
            "Luo salasana käyttääksesi BRINGM3 sovellusta.",
            "Vaihda palettia",
            "Teema ja paletti",
            "Voit mukauttaa sovelluksen väripalettia mieltymyksesi mukaan. Tämän avulla saat tehtyä siitä persoonallisemman.",
            "Lisätietoja",
            "Tämä sovellus luotiin osana opinnäytetyö projektia.\n \nSovellus on suunniteltu kokoamaan ja hallitsemaan perheen tai yksilön kauppalistaa.\n \nTämä projekti on toteutettu Next.js alustalla (Mode, React, Ramda). Lähdekoodi on löydettävissä ",
            "\nMaria Solovievan (paletit), Aleksandr Shchilkin (logo), Alina Grigoryanin (venäjänkielinen käännös) ja Justus Juutilainen (suomenkielinen käännös) avustuksella.  \n \n Jos havaitset ongelmia, ota yhteyttä: ",
            "Kirjaudu ulos",
            "Jos et käytä sovellusta enään tällä laitteella, suosittelemme ulos kirjautumista.",
            "Kirjaudu ulos",
            "Käyttäjätunnus tai salasana väärin.",
            "Käyttäjätunnus on jo olemassa.",
            "Ostoslista",
            "Ostoslista lataa...",
            "Tässä on tarvittavien ostosten lista. Käy ostamassa ne! Tai lisää uusi asia ostettavaksi...",
            "Varasit tämän tuottavaksi.",
            "Peruuta varaus",
            "Tuon sen!",
            "Lisää",
            "lisäsi tämän.",
            "Lisää uusi tarvike",
            "Tästä voit lisätä uuden tarvikkeet ostoslistalle.",
            "Tarvike",
            "Kuvaus",
            "Kirjauduit sisään käyttäjällä ",
            "Takaisin",
            "Käyttäjä voi ",
            "lisätä",
            "varata ja poistaa",
            "Jäsenlista",
            "Tästä voit muokata perheesi jäsenlistaa.",
            "Hallitse käyttäjiä",
            "Täältä voit, perheen pääkäyttäjänä, hallinnoida muita käyttäjiä.",
            "Lisää käyttäjä",
            "Lisätäksesi uuden käyttäjän perheeseesi, luo kirjautuminen ja nimi. Voit määrittää oikeuksia lisätä, varata ja poistaa tarvikkeita ostoslistalta halutessasi. Tallentaaksesi uuden käyttäjän paina 'LISÄÄ' nappia.",
            "Muokkaa käyttäjää",
            "Muokkaa käyttäjää ",
            "tietoja täyttämällä seuraava lomake.",
            "Muokkaa",
            "Aloita perheesi ruokaostosten hallinta BRINGM3 sovelluksella! Se on hauskaa, helppoa ja viihdyttävää! Liity tänään ja tule onnelliseksi!",
            "Jos olet uusi sovelluksen käyttäjä, mene ",
            "rekistöröinti sivulle",
            " ja tule perheen pääkäyttäjäksi.",
            "Tai, jos olet jo kokenut käyttäjä, ",
            "kirjaudu sisään",
            "TAI! Jos perheen pääkäyttäjä rekisteröi sinut, ",
            "aseta salasana",
            " luodulle käyttäjällesi.",
            "Pidä toiminto nappeja painettuna sekunnin ajan käyttääksesi.",
            "Kuinka käyttää?",
            "1. Paina 'LISÄÄ' nappia lisätäksesi uusi tarvike listalle.\n \n2. Tarvike nimen lisäksi voit lisätä kuvauksen.\n \n3. Paina 'LISÄÄ' nappia uudelleen tallentaaksesi uuden tarvikkeen.\n \n4. Kun tarvike on lisätty listalle, voit painaa sitä näyttää käsi kuvauksen, tiedon siitä kuka sen lisäsi ja avata toimintonapit.\n \n5. Varataksesi tarvikkeen listalta, valitse tarvike ja paina 'TUON SEN!' sekunnin ajan.\n \n6. Peruuttaaksesi tarvikkeen varauksen listalta, valitse tarvike ja paina 'PERUUTA VARAUS' nappia sekunnin ajan.\n \n7. Poistaaksesi tarvike listalta, valitse tarvike ja paina valintaa nimen vasemmalla puolella sekunnin ajan.",
            "Linkki rekisteröitymistä varten kopioitu"
        ]
    },
    {
        "lang" : "Русский",
        "content" : [
            "Введите логин и пароль, чтобы начать пользоваться приложением!",
            "Войти",
            "Имя должно содержать минимум 5 знаков.",
            "Имя",
            "Логин должен содержать минимум 5 знаков.",
            "Логин",
            "Пароль должен содержать от 8 знаков, включать цифры, прописные и строчные латинские буквы (A-a), специальные знаки (! ? @ #).",
            "Пароль",
            "Введите имя, логин и пароль, чтобы создать аккаунт.",
            "Пароли не совпадают",
            "Повторите пароль",
            "Новый аккаунт успешно создан! войдите в систему, чтобы начать пользоваться :)",
            "Регистрация",
            "Придумайте пароль, чтобы начать использовать приложение BRINGM3.",
            "Изменить цвет",
            "Тема и цвет",
            "Для удобства вы можете изменить тему и цветовую гамму приложения.",
            "О проекте",
            "Данный проект был разработан для дипломной работы. \n \nПриложение предназначено для составления списка покупок и его редактирования в случае совершения покупки. BRINGM3 рассчитан как на личное, так и на групповое использование.\n \nПриложение написано на платформе Next.js (Node, React, Ramda). Исходный код находится на ",
            "\nПроект создан Денисом Куйвалайненом при поддержке Марии Соловьевой (оформление), Александра Щилкина (лого), Алины Григорян (перевод текста на русский язык) и Юстуса Юютилайнена (перевод текста на финский язык). \n \n В случае возникновения каких-либо проблем свяжитесь со мной: ",
            "Выход из системы",
            "Если вы закончили пользоваться приложением на этом устройстве, рекомендуем вам выйти из системы.",
            "Выход",
            "Логин или пароль не верны.",
            "Такой илогин уже существует. Придумайте другое.",
            "Список покупок",
            "Список покупок загружается...",
            "Здесь находится перечень всего того, что нужно купить. Так чего же вы ждёте? Принесите что-нибудь! Или добавьте то, что вам нужно, и кто-нибудь это принесёт... ",
            "Это решил принести ты.",
            "Отменить резервацию",
            "Я принесу это!",
            "Добавить",
            "добавил(а) это.",
            "Добавьте что-то новое",
            "Здесь вы можете добавить товар, который нужно купить.",
            "Товар",
            "Описание",
            "Вы вошли в систему как ",
            "Назад",
            "Может ",
            "добавлять",
            "резервировать и удалять",
            "Управление пользователями",
            "В этом разделе вы можете редактировать список пользователей, входящих в вашу семью.",
            "Управление пользователями",
            "В этом разделе вы можете редактировать список членов семьи.",
            "Добавить пользователя",
            "Введите логин и имя нового пользователя, которого хотите включить в вашу семью. При желании вы можете дать ему право на добавление, резервирование и удаление товаров, нажав кнопки ниже. Чтобы сохранить данного пользователя в вашей семье, нажмите кнопку 'ДОБАВИТЬ'.",
            "Редактировать пользователя",
            "Измените информацию о пользователе ",
            "заполнив форму ниже.",
            "Изменить",
            "Начните управлять семейными покупками с приложением BRINGM3! Это легко и просто! Присоединяйтесь!",
            "Если вы только пришли, то вам нужно ",
            "зарегистрироваться",
            " и стать главой семьи.",
            "Или, если вы уже пользуетесь приложением, ",
            "войдите в систему",
            "ИЛИ! Если вас зарегистрировал глава вашей семьи, ",
            "создайте пароль",
            " для вышего нового аккаунта.",
            "Для работы со списком удерживайте нужную кнопку действия в течение секунды.",
            "Как пользоваться?",
            "1. Нажмите кнопку 'ДОБАВИТЬ', чтобы создать новую вещь для покупки. \n \n2. При желании можно указать не только название товара, но и его описание. \n \n3. Вновь нажмите кнопку 'ДОБАВИТЬ', чтобы сохранить товар. \n \n4. После того, как товар добавлен в список, вы можете нажать на стрелочку, где располагается описание товара, имя пользователя, добавившего товар и кнопка 'Я ПРИНЕСУ ЭТО!'. \n \n5. Чтобы сделать пункт списка зарезервированным, выберете необходимый товар для резервации, нажмите кнопку 'Я ПРИНЕСУ ЭТО!' и удерживайте в течение нескольких секунд. \n \n6. Чтобы отменить резервацию, выберете зарезервированный товар и нажмите 'ОТМЕНИТЬ РЕЗЕРВАЦИЮ' и удерживайте в течение нескольких секунд. \n \n7. Чтобы удалить из списка, выберете зарезервированный товар и нажмите галочку слева от названия и удерживайте в течение нескольких секунд.",
            "Ссылка для регистрации скопирована"
        ]
    }
]